class Address {
  static List<Map<String, dynamic>> addresses = [
    {
      "province": "ນະຄອນຫຼວງວຽງຈັນ",
      "district": [
        {"name": "ຈັນທະບູລີ"},
        {"name": "ສີໂຄດຕະບອງ"},
        {"name": "ໄຊເສດຖາ"},
        {"name": "ສີສັດຕະນາກ"},
        {"name": "ນາຊາຍທອງ"},
        {"name": "ໄຊທານີ"},
        {"name": "ຫາດຊາຍຟອງ"},
        {"name": "ສັງທອງ"},
        {"name": "ປາກງື່ມ"},
      ]
    },
    {
      "province": "ຜົ້ງສາລີ",
      "district": [
        {"name": "ຜົ້ງສາລີ"},
        {"name": "ໃໝ່"},
        {"name": "ຂວາ"},
        {"name": "ສຳພັນ"},
        {"name": "ບຸນເໜືອ"},
        {"name": "ຍອດອູ"},
        {"name": "ບຸນໃຕ້"},
      ]
    },
    {
      "province": "ຫຼວງນ້ຳທາ",
      "district": [
        {"name": "ຫຼວງນ້ຳທາ"},
        {"name": "ສິງ"},
        {"name": "ລອງ"},
        {"name": "ວຽງພູຄາ"},
        {"name": "ນາແລ"},
      ]
    },
    {
      "province": "ອຸດົມໄຊ",
      "district": [
        {"name": "ໄຊ"},
        {"name": "ຫຼາ"},
        {"name": "ນາໝໍ້"},
        {"name": "ງາ"},
        {"name": "ແບ່ງ"},
        {"name": "ຮຸນ"},
        {"name": "ປາກແບ່ງ"},
      ]
    },
    {
      "province": "ບໍ່ແກ້ວ",
      "district": [
        {"name": "ຫ້ວຍຊາຍ"},
        {"name": "ຕົ້ນເຜິ້ງ"},
        {"name": "ເມິງ"},
        {"name": "ຜາອຸດົມ"},
        {"name": "ປາກທາ"},
      ]
    },
    {
      "province": "ຫຼວງພະບາງ",
      "district": [
        {"name": "ຫຼວງພະບາງ"},
        {"name": "ຊຽງເງິນ"},
        {"name": "ນານ"},
        {"name": "ປາກອູ"},
        {"name": "ນ້ຳບາກ"},
        {"name": "ງອຍ"},
        {"name": "ປາກແຊງ"},
        {"name": "ໂພນໄຊ"},
        {"name": "ຈອມເພັດ"},
        {"name": "ວຽງຄຳ"},
        {"name": "ພູຄູນ"},
        {"name": "ໂພນທອງ"},
      ]
    },
    {
      "province": "ຫົວພັນ",
      "district": [
        {"name": "ຊຳເໜືອ"},
        {"name": "ຊຽງຄໍ້"},
        {"name": "ວຽງທອງ"},
        {"name": "ວຽງໄຊ"},
        {"name": "ຫົວເມືອງ"},
        {"name": "ຊຳໃຕ້"},
        {"name": "ສົບເບົາ"},
        {"name": "ແອດ"},
        {"name": "ກັວນ"},
        {"name": "ຊ່ອນ"},
      ]
    },
    {
      "province": "ໄຊຍະບູລີ",
      "district": [
        {"name": "ໄຊຍະບູລີ"},
        {"name": "ຄອບ"},
        {"name": "ຫົງສາ"},
        {"name": "ເງິນ"},
        {"name": "ຊຽງຮ່ອນ"},
        {"name": "ພຽງ"},
        {"name": "ປາກລາຍ"},
        {"name": "ແກ່ນທ້າວ"},
        {"name": "ບໍ່ແຕນ"},
        {"name": "ທົ່ງມີໄຊ"},
        {"name": "ໄຊສະຖານ"},
      ]
    },
    {
      "province": "ຊຽງຂວາງ",
      "district": [
        {"name": "ແປກ"},
        {"name": "ຄຳ"},
        {"name": "ໜອງແຮດ"},
        {"name": "ຄູນ"},
        {"name": "ໝອກໃໝ່"},
        {"name": "ພູກູດ"},
        {"name": "ຜາໄຊ"},
      ]
    },
    {
      "province": "ວຽງຈັນ",
      "district": [
        {"name": "ໂພນໂຮງ"},
        {"name": "ທຸລະຄົມ"},
        {"name": "ແກ້ວອຸດົມ"},
        {"name": "ກາສີ"},
        {"name": "ວັງວຽງ"},
        {"name": "ເຟືອງ"},
        {"name": "ຊະນະຄາມ"},
        {"name": "ແມດ"},
        {"name": "ວຽງຄຳ"},
        {"name": "ຫີນເຫີບ"},
        {"name": "ໝື່ນ"},
      ]
    },
    {
      "province": "ໄຊສົມບູນ",
      "district": [
        {"name": "ອະນຸວົງ"},
        {"name": "ລ້ອງແຈ້ງ"},
        {"name": "ຮົ່ມ"},
        {"name": "ທ່າໂທມ"},
        {"name": "ໄຊສົມບູນ"},
      ]
    },
    {
      "province": "ບໍລິຄຳໄຊ",
      "district": [
        {"name": "ປາກຊັນ"},
        {"name": "ທ່າພະບາດ"},
        {"name": "ປາກກະດິງ"},
        {"name": "ບໍລິຄັນ"},
        {"name": "ຄຳເກີດ"},
        {"name": "ວຽງທອງ"},
        {"name": "ໄຊຈຳພອນ"},
      ]
    },
    {
      "province": "ຄຳມ່ວນ",
      "district": [
        {"name": "ທ່າແຂກ"},
        {"name": "ມະຫາໄຊ"},
        {"name": "ໜອງບົກ"},
        {"name": "ຫີນບູນ"},
        {"name": "ຍົມມະລາດ"},
        {"name": "ບົວລະພາ"},
        {"name": "ນາກາຍ"},
        {"name": "ເຊບັ້ງໄຟ"},
        {"name": "ໄຊບົວທອງ"},
      ]
    },
    {
      "province": "ສະຫວັນນະເຂດ",
      "district": [
        {"name": "ໄກສອນ ພົມວິຫານ"},
        {"name": "ອຸທຸມພອນ"},
        {"name": "ອາດສະພັງທອງ"},
        {"name": "ພິນ"},
        {"name": "ເຊໂປນ"},
        {"name": "ນອງ"},
        {"name": "ທ່າປາງທອງ"},
        {"name": "ສອງຄອນ"},
        {"name": "ຈຳພອນ"},
        {"name": "ຊົນນະບູລີ"},
        {"name": "ໄຊບູລີ"},
        {"name": "ວິລະບູລີ"},
        {"name": "ອາດສະພອນ"},
        {"name": "ໄຊພູທອງ"},
        {"name": "ພະລານໄຊ"},
      ]
    },
    {
      "province": "ສາລະວັນ",
      "district": [
        {"name": "ສາລະວັນ"},
        {"name": "ຕະໂອ້ຍ"},
        {"name": "ຕຸ້ມລານ"},
        {"name": "ລະຄອນເພັງ"},
        {"name": "ວາປີ"},
        {"name": "ຄົງເຊໂດນ"},
        {"name": "ເລົ່າງາມ"},
        {"name": "ສະມ້ວຍ"},
      ]
    },
    {
      "province": "ເຊກອງ",
      "district": [
        {"name": "ລະມາມ"},
        {"name": "ກະລຶມ"},
        {"name": "ດາກຈຶງ"},
        {"name": "ທ່າເຕັງ"},
      ]
    },
    {
      "province": "ຈຳປາສັກ",
      "district": [
        {"name": "ປາກເຊ"},
        {"name": "ຊະນະສົມບູນ"},
        {"name": "ບາຈຽງຈະເລີນສຸກ"},
        {"name": "ປາກຊ່ອງ"},
        {"name": "ປະທຸມພອນ"},
        {"name": "ໂພນທອງ"},
        {"name": "ຈຳປາສັກ"},
        {"name": "ສຸຂຸມາ"},
        {"name": "ມູນລະປະໂມກ"},
        {"name": "ໂຂງ"},
      ]
    },
    {
      "province": "ອັດຕະປື",
      "district": [
        {"name": "ສາມັກຄີໄຊ"},
        {"name": "ສະໜາມໄຊ"},
        {"name": "ສານໄຊ"},
        {"name": "ພູວົງ"},
        {"name": "ໄຊເສດຖາ"},
      ]
    },
  ];
}